app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 2)

  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save
---
INSERT INTO `photos` (`updated_at`, `description`, `filename`, `created_at`) VALUES('2009-01-09 10:20:09', 'rails\'s photo', 'rails.jpg', '2009-01-09 10:20:09')

  def update
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 5)

  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
DELETE FROM `photos` WHERE `id` = 1