app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-01-07 10:31:52', 'Blogging ', 'Blogging is my first task ', '2009-01-07 10:31:52')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `body` = 'Blogging is my first task and need to learn more on how to create a blog', `updated_at` = '2009-01-07 10:32:21' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])